# Welcome to the Data Manipulation Exercises

The workbook has been broken up into three sections.  Each section correlates to a reading assignment within the textbook.

In [1]:
import pandas as pd
import numpy as np

data= pd.read_csv("titanic.csv")
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## Before You Get Started

We are going to be using the Titanic Dataset. Make sure to run a head() before you start working with manipulation methods.

In [2]:
# Run the head of your data set here:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# check for duplicates
data.duplicated().sum()

np.int64(107)

In [4]:
# if there are, go ahead and drop them:
data.drop_duplicates(inplace=True)

data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### Cleaning Note:

While the columns are not the "prettiest", don't adjust any of them yet. We are going to update some values and add some values as we workthrough this notebook. Apologies for the extra visual "noise" on your screen. You will be given the option to tidy up the columns at the end of this notebook.

## Running Tables Note:  
If your tables don't appear to have accepted your changes, try the "Run All" option in the "Cell" section of the menu bar.

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# A. Aggregation

1. Work through the section Exercises.  
    - There are 4 sections in part A:
        - Groupby
        - Aggregation Methods
        - Groupby and Basic Math
        - Groupby and Multiple Aggregations

#### Creating Variables.

As we begin to manipulate our data, create new variables to store your work in.  This will keep your original data in tact.  Having the original dataset available will save you time with each manipulation.  You can also create variable names that inform you of the purpose of the manipulation.

### 1: Groupby <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Groupby "embark_town"

1. Using the titanic data set, groupby "embark_town".
1. Create a variable that will represent the grouping of data. 
1. Initialize it using the groupby() function and pass it the column.

In [5]:
# Code your groupby "embark_town" here:
groupby_embark_town = data.groupby("embark_town")

In [6]:
# To view the grouped data as a table, use the variable_name.first():
groupby_embark_town.first()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone
embark_town,,,,,,,,,,,,,,
Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,yes,False
Queenstown,0,3,male,2.0,0,0,8.4583,Q,Third,man,True,C,no,True
Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,no,False

#### Groupby "survived"

Did you know that you can also chain on some of our exploratory methods to the groupby method?

1. Create & initalize a new variable to hold a table that will groupby "survived" 
1. Use method chaining to tack on the describe method

In [7]:
# Code your groupby "survived" table here:

groupby_survived = data.groupby("survived")
# run your table below:

print(groupby_survived)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001B77F408050>

In [8]:
# run your table with describe
groupby_survived.describe()

         pclass                                                 age  \
          count      mean       std  min  25%  50%  75%  max  count
survived
0         461.0  2.481562  0.770507  1.0  2.0  3.0  3.0  3.0  394.0
1         323.0  1.904025  0.856152  1.0  1.0  2.0  3.0  3.0  284.0

                     ... parch        fare                                     \
               mean  ...   75%  max  count       mean        std  min     25%
survived             ...
0         30.953046  ...   0.0  6.0  461.0  23.944531  33.336385  0.0   7.875
1         28.365915  ...   1.0  5.0  323.0  50.079180  68.009971  0.0  12.825


            50%       75%       max
survived
0         13.00  26.55000  263.0000
1         26.25  61.37915  512.3292

[2 rows x 40 columns]

In [9]:
# How is this table organized?  Why are there 40 columns now? 
#  2 rows and 40 columns.
# Each column with numeric data has additional sub columns with 8 stats

### 2. Aggregation Methods <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Note: **agg()** and **aggregate()** are identical [source](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.aggregate.html)

#### Method Chaining

1. Create a variable to method chain **head()** and **agg()** togehter.
1. Pass one of the following statistical values to **agg()**
   - "mean", "median", "mode", "min", "max", "std", "var", "first", "last", "sum"

In [10]:
# Code your method chain here:

In [11]:
# Create a variable to method chain head() with agg("sum")
data_aggregate = groupby_embark_town.agg('sum').head()
# run your table:
data_aggregate

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone
embark_town,,,,,,,,,,,,,,
Cherbourg,90,282,femalefemalefemalemalemalefemalemalemalefemale...,3981.17,62,59,9875.0587,CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC...,FirstSecondThirdThirdFirstFirstFirstThirdThird...,womanchildwomanmanmanwomanmanmanchildmanchildm...,79,CBDBADBFBACBBADDCBDBCECBECBEDBECDCCDBBDCBBCCAC...,yesyesyesnonoyesnoyesyesnoyesnoyesnonononoyesn...,74
Queenstown,20,170,malemalefemalefemalefemalefemalemalefemalefema...,786.50,30,13,859.2459,QQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQ...,ThirdThirdThirdThirdThirdThirdThirdThirdThirdT...,manchildchildwomanwomanwomanmanwomanwomanmanma...,29,CECF,nonoyesyesyesyesnoyesyesnononoyesnoyesnoyesnon...,42
Southampton,211,1305,malefemalefemalemalemalemalefemalefemalefemale...,15383.75,318,254,16319.6993,SSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS...,ThirdThirdFirstThirdFirstThirdThirdThirdFirstT...,manwomanwomanmanmanchildwomanchildwomanmanmanc...,343,CEGCDACCCFFCEDCEDDCFCEBFAFGCCDGCBEBCCDACCCCDCC...,noyesyesnononoyesyesyesnononoyesyesnonoyesyesn...,328

In [12]:
# Explain the sum table.  What is going on with the "sex", "class", and "alive" columns?

# for each of these columns we have all the values in one row as these are non-numerical values.

#### Using a Dictionary <span style="color:darkorange;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
##### A dictionary is a Python collection type.  

Is a collection type that stores **key-value pairs**.  A key-value pair is an organization system that is made up of a single *key* that has one or more *values* paired with it.  
Think of it like your contacts list.  The contacts list is the dictionary object.  
Each contact is organized by a key, usually name.  And attached to each name is contact information, or the values.
Some contacts might have email address, phone number, home or work address, etc. Other contacts may just be a name and phone number.  This is a very simple example, but understanding this organizational structure will be helpful as you learn to manipulate tables.  

*Here is a dictionary example with 3 keys:*
>**contacts_dictionary = {"name1": ["email", 555-5552, "work info"], 
      "name2": ["email", 555-5554],
      "name3": 555-5555}**
                     
*Here is a dictionary example with a single key-value pair*
**study_group_dictionary = {"john": ["john@email.com", 555-555-5555, "works at LaunchCode headquarters"]}**   

It has a single key, and a list of values. The organization of this structure is called a "Key-Value Pair".
Using the contact list example, the key would be the name of the person and the values would be their contact information.  The key is a single item (the person's name) and the values can be a single item (an email address) or mulitple items (email, phone number, address, work info, etc).
Keys and values can be any data type, but must use correct data type syntax.  The keys do not have to be strings, but they do need to be a single value.  

For more information, you can read more on dictionary objects [here](https://www.w3schools.com/python/python_dictionaries.asp).

#### Aggregation across multiple columns using dictionary functionality

##### Syntax Example:

**age_dictionary={"age":["sum", "max"]}**

We are creating a new dictionary (**age_dictionary**).  The key is **age** and the values we want are **"sum""** and **"max"**.  This dictionary object has now become a tempate for the aggregations we want to preform.  However, on it's own, it does nothing.  Once passed to the **agg()** method, it will pick out the specific location of data we want to examine.  Making a subset table.  

The code is contained in the box below.  Run it and see what happens.


For syntax examples, review [this webpage](https://www.geeksforgeeks.org/python-pandas-dataframe-aggregate/).
#### <span style="color:coral;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In [13]:
# Predict the table output before you uncomment the code below.

age_dictionary={"age":["sum", "max"]}
dictionary_agg=data.agg(age_dictionary)
dictionary_agg

          age
sum  20251.42
max     80.00

1. What if we want to look at more than one column at a time?  We pass more dictionaries to the agg function.
1. Create a variable to hold at least 3 columns.  Use the syntax from the "Syntax Example" as a guide.
    - Aggregate the following:  survived: "sum" & "count"; age: "std" & "min", and sibsp: "count" & "sum"

In [14]:
# Code your dictionary here:

aggregate_dicitionary = {
                    "survived": ["sum", "count"],
                    "age": ["std", "min"],  
                    "sibsp": ["count", "sum"]
}

multiple_columns_aggregate = data.agg(aggregate_dicitionary)

multiple_columns_aggregate

       survived        age  sibsp
sum       323.0        NaN  410.0
count     784.0        NaN  784.0
std         NaN  14.759076    NaN
min         NaN   0.420000    NaN

### 3. Groupby and Basic Math <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Groupby "pclass".  Make sure you use a variable to hold your grouped data.

In [15]:
# Code your groupby here:

# <WARNING> For this section, you will need to filter out non-numeric data to run the aggregations
## Uncomment the line below, and use this 'num_only_data' variable as needed for Section 3 and Section 4
num_only_data = data.select_dtypes(include='number')


# Run your table using first() here instead of head():

groupby_pclass = data.groupby("pclass")
groupby_pclass[num_only_data.columns].agg(["sum", "mean", "min", "max"])

       survived                   pclass                   age             \
            sum      mean min max    sum mean min max      sum       mean
pclass
1           135  0.630841   0   1    214  1.0   1   1  7087.42  38.310378
2            84  0.509091   0   1    330  2.0   2   2  4753.83  29.898302
3           104  0.256790   0   1   1215  3.0   3   3  8410.17  25.180150

        ... sibsp     parch                          fare                  \
        ...   min max   sum      mean min max         sum       mean  min
pclass  ...
1       ...     0   3    77  0.359813   0   4  18080.3917  84.487812  0.0
2       ...     0   3    70  0.424242   0   3   3602.8417  21.835404  0.0
3       ...     0   8   179  0.441975   0   6   5530.7705  13.656223  0.0


             max
pclass
1       512.3292
2        73.5000
3        69.5500

[3 rows x 24 columns]

### 4. Groupby and Multiple Aggregations <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Group with a List<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1. We want to do muliple aggregation functions to our newly grouped data set.  We created a variable to hold a list of functions we want to perform.  These functions are part of the agg method.  When we pass our list to the method, the method will iterate through each item and perform that function for the entire table.

In [16]:
# our list of functions
agg_func_list = ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
num_only_data = data.select_dtypes(include='number')
groupby_pclass = data.groupby("pclass")
#Apply the agg method to our passenger_class variable (made in the Groupby Basic Math section).  
# Pass our list to the function and run your table.
aggregate_variable = groupby_pclass[num_only_data.columns].agg(agg_func_list)
aggregate_variable

       survived                                                                \
            sum      mean median min max       std       var first last count
pclass
1           135  0.630841    1.0   0   1  0.483709  0.233974     1    1   214
2            84  0.509091    1.0   0   1  0.501439  0.251441     1    0   165
3           104  0.256790    0.0   0   1  0.437403  0.191321     0    0   405

        ...        fare                                                \
        ...         sum       mean   median  min       max        std
pclass  ...
1       ...  18080.3917  84.487812  60.2875  0.0  512.3292  78.645207
2       ...   3602.8417  21.835404  18.7500  0.0   73.5000  13.475409
3       ...   5530.7705  13.656223   8.0500  0.0   69.5500  10.666808


                var    first   last count
pclass
1       6185.068602  71.2833  30.00   214
2        181.586649  30.0708  10.50   165
3        113.780790   7.2500   7.75   405

[3 rows x 60 columns]

#### Group with a Dictionary<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Using only a list provides us with the entire table.  What if we only want to look at age vs pclass?  

we can create a dictionary to hold the age column for us.  The *key* would be the name of our column, and the values our list of functions to perform on that column.  The code would look like this:

In [17]:
agg_func_dict = {
    'age':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
# We would run our table like this:
groupby_pclass.agg(agg_func_dict)

            age                                                             \
            sum       mean median   min   max        std         var first
pclass
1       7087.42  38.310378   37.0  0.92  80.0  14.805690  219.208448  38.0
2       4753.83  29.898302   29.0  0.67  70.0  14.429912  208.222356  14.0
3       8410.17  25.180150   24.0  0.42  74.0  12.700275  161.296995  22.0


        last count
pclass
1       26.0   185
2       28.0   159
3       32.0   334

Looking at the *age_func_dict* syntax, create a dictionary variable for the "survived" column and pass it to **passenger_class.agg()** in the box below.

In [18]:
# Code it here:

agg_func_dict = {
    'survived':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}

groupby_pclass.agg(agg_func_dict)

       survived
            sum      mean median min max       std       var first last count
pclass
1           135  0.630841    1.0   0   1  0.483709  0.233974     1    1   214
2            84  0.509091    1.0   0   1  0.501439  0.251441     1    0   165
3           104  0.256790    0.0   0   1  0.437403  0.191321     0    0   405

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# B. Recoding and Creating New Values and Variables 

1. Work through the Part B, there are 3 sections

### Create a New Column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

In the box below:
1. Create a new column by manipulating the values of an existing column.  Specifically, create a new column, "fare_2021" that allows us to compare the cost of fare in pounds back in 1912 to 2021.  [This website](https://www.in2013dollars.com/uk/inflation/1912) can help you find the 2021 fare amount.

In [19]:
# Code your new "fare_2021" column here:
inflation_multiplier = 145.97

data["fare_2021"] = data["fare"] * inflation_multiplier

# Run the head of your table to see your new column:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1058.282500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,10405.223301
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1156.812250
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,7751.007000
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1175.058500

### Replacing Values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
 
Replace the string-based "yes","no" values in the "alive" column using booleans, replacing "yes" values with True and "no" values with False.

In [20]:
# Code your updated values here:

data["alive"] = data["alive"].replace({"yes": "True", "no":"False"})

data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,1058.282500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False,10405.223301
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True,1156.812250
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False,7751.007000
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,1175.058500

We can also use functions to update values.

1. Create a function that will convert the string-based "alive" values of "yes" or "no" to a boolean value of True or False. Apply it to your table and run your table here:

In [21]:
# Code your function here:
def alive(data):
    alive = data["alive"]
    if alive == 'yes':
        return True
    else:
        return False
data["alive"] = data.apply(alive,axis=1)

data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,1058.282500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,False,False,10405.223301
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,False,True,1156.812250
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,False,False,7751.007000
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,1175.058500
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,False,False,4251.376250
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,False,True,4379.100000
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,False,False,3422.996500
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,False,True,4379.100000
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,False,True,1131.267500

### Using a function to create a new column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

Sometimes you might want to create a new column based on combining multiple columns together.

1. create an "age_group" column that breaks years up as 0-19, 20-29, 30-39, etc until all given ages are covered.  Make sure you check to see where you can stop counting by 10s.

In [22]:
# Write your max age check here: 80 years
data["age"].describe()

count    678.000000
mean      29.869351
std       14.759076
min        0.420000
25%       20.000000
50%       28.250000
75%       39.000000
max       80.000000
Name: age, dtype: float64

In [23]:
# Code the new "age_group" column function here:
# data["age"] = data["age"].fillna("Unknown")
bins = list(range(0, 90, 10))  # 0,10,20,...,80
labels = [f"{i}-{i+9}" for i in bins[:-1]]

data["age_group"] = pd.cut(data["age"], bins= bins, labels= labels)

data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021,age_group
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,1058.282500,20-29
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,False,False,10405.223301,30-39
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,False,True,1156.812250,20-29
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,False,False,7751.007000,30-39
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,1175.058500,30-39
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,False,False,4251.376250,30-39
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,False,True,4379.100000,10-19
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,False,False,3422.996500,NaN
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,False,True,4379.100000,20-29
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,False,True,1131.267500,30-39

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# C. Reshaping Tables

1. Work through Part C, there are 4 sections

### Sort_values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Use **sort_values()** to answer the following question:
> What is the age of the person who paid the highest fare?

Hint: We want to see the highest fare value first. To find this, should we set the sort order to ascending or descending?  Check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values) for the syntax.

In [24]:
# Code your sort_values here:
data_sorted = data.sort_values(by= ["age","fare"], ascending=False)

# Run your table here:
data_sorted

#  80 year old and paid 30 dollars

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021,age_group
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,False,True,4379.100000,70-79
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,False,True,1134.916750,70-79
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,False,True,7226.128074,70-79
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,False,True,5058.473574,70-79
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,False,True,1131.267500,70-79
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
825,0,3,male,NaN,0,0,6.9500,Q,Third,man,True,NaN,Queenstown,False,True,1014.491500,NaN
411,0,3,male,NaN,0,0,6.8583,Q,Third,man,True,NaN,Queenstown,False,True,1001.106051,NaN
277,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,False,True,0.000000,NaN
633,0,1,male,NaN,0,0,0.0000,S,First,man,True,NaN,Southampton,False,True,0.000000,NaN
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,False,True,0.000000,NaN

### pivot_table <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
1. pivot the table of the summed data where the values are "fare", index is "who" and "age_group", and the columns are "survived"

Hint: set the aggfunc parameter to np.sum

In [25]:

# Code your pivot_table here:
data_pivot = data.pivot_table(
        values="fare",
        index= ["who", "age_group"],
        columns= "survived",
        aggfunc= sum
)

# Run your table here:
data_pivot

C:\Users\User\AppData\Local\Temp\ipykernel_23792\3057503653.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  data_pivot = data.pivot_table(
C:\Users\User\AppData\Local\Temp\ipykernel_23792\3057503653.py:2: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  data_pivot = data.pivot_table(

survived                 0          1
who   age_group
child 0-9         896.4583  1032.0875
      10-19       213.0876   560.3293
      20-29         0.0000     0.0000
      30-39         0.0000     0.0000
      40-49         0.0000     0.0000
      50-59         0.0000     0.0000
      60-69         0.0000     0.0000
      70-79         0.0000     0.0000
man   0-9           0.0000     0.0000
      10-19      1005.9333   176.4292
      20-29      2347.7413   625.5583
      30-39      1358.4455  1685.9501
      40-49      1199.7208   569.3293
      50-59       735.4792   171.7500
      60-69       602.4375    10.5000
      70-79        99.6834    30.0000
woman 0-9           0.0000     0.0000
      10-19       144.6250  1243.0209
      20-29       419.0750  2839.3083
      30-39       141.5667  3273.4124
      40-49       260.4917  1491.9418
      50-59        10.5000   962.8125
      60-69         0.0000   167.5458
      70-79         0.0000     0.0000

### Wide to Long <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Create a table where the columns are "who" and the values are "pclass"
1. Answer the question:  How does this table differ from the pivot_table above?  Specifically, how is "who" different?

In [26]:
# Code your table here:

wide_table = data.pivot(
    columns="who",
    values="pclass"
)
# Run your table here:
wide_table

# Answer the question here:

#  Who is column in wide table and we have 3 columns for child, man and women. While in the pivot table, 
# who is an index and data is grouped with it.

who  child  man  woman
0      NaN  3.0    NaN
1      NaN  NaN    1.0
2      NaN  NaN    3.0
3      NaN  NaN    1.0
4      NaN  3.0    NaN
..     ...  ...    ...
885    NaN  NaN    3.0
887    NaN  NaN    1.0
888    NaN  NaN    3.0
889    NaN  1.0    NaN
890    NaN  3.0    NaN

[784 rows x 3 columns]

### Melt <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1.  What does the **melt** function do to the data?

In [27]:
# What does melt do?
#  Melt function can be used to reshape tables from wide format to long format.

2.  With a new variable, apply a default melt to your data.

In [28]:
# Create your default melt table here with the following syntax:  new_name = pd.melt(data_set)
data = pd.read_csv("titanic.csv")

new_data = pd.melt(data)
# Run your table here:

new_data
# Check the shape of your new table.
new_data.shape

(13365, 2)

3. Create a melt table where the index variables are "embarked", and the values are "fare" and "deck"

In [35]:
# Create your melt table here:

data = pd.read_csv("titanic.csv")

data

long_format_dataset = pd.melt(
    data,
    id_vars="embarked",
    value_vars=["fare", "deck"],
    var_name="variable",
    value_name="value"
)
# Run your table here:

long_format_dataset 

# Check the shape

long_format_dataset.shape

(1782, 3)

# Optonal Challenges:

1. Clean and Explore the table.  
    1. How would you handle any missing data?
    1. Would you keep all of the columns?
    1. Would you want to manipulate any data?